# SupportedColorFillCategoryIds Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
View..::..SupportedColorFillCategoryIds Method
View Class See Also
---
Returns collection of all category ids that correspond to elements that can potentially be colored in this view according to a color fill scheme. The set may be different depending on the view type.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public ICollection<ElementId> SupportedColorFillCategoryIds()
```

Visual Basic
---
```text
Public Function SupportedColorFillCategoryIds As ICollection(Of ElementId)
```

Visual C++
---
```text
public:
ICollection<ElementId^>^ SupportedColorFillCategoryIds()
```

# Remarks
All of the possible categories are OST_Rooms, OST_HVAC_Zones, OST_MEPSpaces, OST_Areas, OST_DuctCurves and OST_PipeCurves.
# See Also
View Class
Autodesk.Revit.DB Namespace